function solution(v) {
    const [x1, y1] = v[0];
    const [x2, y2] = v[1];
    const [x3, y3] = v[2];
    
    const coorX = [x1, x2, x3];
    const coorY = [y1, y2, y3];
    
    let x = Math.max(x1, x2, x3);
    let cnt = 0;
    for(let i = 0; i < 3; i++){
        if(coorX[i] === x)
            cnt++;
    }
    // if(cnt === 1) // 큰녀석이 하나만 있는거니까 큰 녀석이 x값
    if(cnt === 2)
        x = Math.min(x1, x2, x3);
    
    let y = Math.max(y1, y2, y3);
    cnt = 0;
    for(let i = 0; i < 3; i++){
        if(coorY[i] === y)
            cnt++;
    }
    // if(cnt === 1) // 큰녀석이 하나만 있는거니까 큰 녀석이 x값
    if(cnt === 2)
        y = Math.min(y1, y2, y3);

    return [x, y];
}

// 직사각형을 만드는 데 필요한 4개의 점 중 3개의 좌표가 주어질 때, 나머지 한 점의 좌표를 구하려고 합니다. 점 3개의 좌표가 들어있는 배열 v가 매개변수로 주어질 때, 직사각형을 만드는 데 필요한 나머지 한 점의 좌표를 return 하도록 solution 함수를 완성해주세요. 단, 직사각형의 각 변은 x축, y축에 평행하며, 반드시 직사각형을 만들 수 있는 경우만 입력으로 주어집니다.

// 제한사항
// v는 세 점의 좌표가 들어있는 2차원 배열입니다.
// v의 각 원소는 점의 좌표를 나타내며, 좌표는 [x축 좌표, y축 좌표] 순으로 주어집니다.
// 좌표값은 1 이상 10억 이하의 자연수입니다.
// 직사각형을 만드는 데 필요한 나머지 한 점의 좌표를 [x축 좌표, y축 좌표] 순으로 담아 return 해주세요.
// 입출력 예
// v	result
// [[1, 4], [3, 4], [3, 10]]	[1, 10]
// [[1, 1], [2, 2], [1, 2]]	[2, 1]